package ru.gb.lesson3.homework;

public class App {
    /*
    Разработайте класс Student  с полями String name, int age, transient double GPA(средний балл)
    Обеспечьте поддержку сериализации этого класса
    Создайте объект класса Student и инициализируйте его данными
    Сериализуйте этот объект в файл
    Десериализуйте этот объект обратно в программу из файла
    Выведите все поля объекта, ключая GPA и обсудите, почему значение GPA не было сохранено/восстановлено
    ++ реализовать сериализацию json и  xml
    * */
}
